---
kind: method
id: M:Autodesk.Revit.DB.GenericForm.GetVisibility
source: html/cbacc716-ecae-cc02-005f-ee8921eafcf5.htm
---
# Autodesk.Revit.DB.GenericForm.GetVisibility Method

Gets the visibility for the generic form.

## Syntax (C#)
```csharp
public FamilyElementVisibility GetVisibility()
```

## Returns
A copy of visibility settings for the generic form.